{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"John Doe","url":"http://yoursite.com"},"pages":[{"title":"sncxp's about","date":"2018-10-11T12:23:47.000Z","updated":"2018-10-11T12:35:43.916Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"看了这么多年的体育比赛，忽然想写点东西浅谈自己对于体育的一些看法，先从当今世界第一运动足球开始写起吧。 梅西c罗 绝代双骄 要问起当今足坛最有实力的足球远动员，答案可能有且只有两个，梅西，c罗。从一个简单的数据可以看出梅西c罗的能力。从2008到2017，这十年金球奖从来没有被别人获得过，c罗，梅西一人5次。当然，梅西和c罗谁的实力更强，大家一直在争论，而且从来没有得到过一个让所有人都信服的答案。作为一个球迷，我更喜欢c罗。(由于我更喜欢c罗，在下文举例子以c罗为主)。 c罗，全名克里斯蒂亚诺·罗纳尔多，1985年出生于葡萄牙的美丽小岛，马德拉。这里距离葡萄牙首都里斯本一千公里。c罗自幼拥有比较强的足球天赋，12岁时被里斯本的球探看中，从马德拉奔赴里斯本，从此开启自己的足球成长与球技显著提高之路，司职前锋，2003年在弗格森执教的曼联打入自己在曼联的处子球，于2009年加入他的成名的地方且效力至今的俱乐部银河战舰～皇家马德里。 梅西，全名里奥·梅西，1987年出生于阿根廷罗里奥市，足球天赋很好，很早就被巴萨球探看中。但无奈身体有生长激素缺乏症，而家人和当时他效力的俱乐部支付不起他的治疗费用。于是，他就离开南美，奔赴欧洲，前往西班牙的巴萨罗那，从此开启属于梅西的足球之路。也就此进入了他的成名且效力至今的球队～巴塞罗那。 梅西，c罗，这两个足坛的很有实力的球员，已经为球迷们上演了一场十年多的巅峰对决。从2008到2018，这十年，足坛有很多故事，也有很多巅峰时刻，有过西班牙在2010年南非世界杯所向披靡，夺得冠军；也有过德意志战车在2014年重新崛起，在巴西夺得大力神杯；还有过诺伊尔重新定义门将，诠释“门卫”的概念……但是没有任何人的个人荣誉，个人能力能和梅西c罗相比，别说相比了，相提并论都难。不过，很遗憾，他们都从来没有亲手触碰过大力神杯。但是梅西c罗几乎拿遍了除了世界杯冠军之外他们能拿到的所有个人荣誉。例如，c罗，英超冠军，英格兰足总杯冠军，西甲冠军，西班牙国王杯冠军，西班牙超级杯冠军，欧冠冠军，尤其，值得一提的是，他所领衔的皇马是欧冠改制后第一支卫冕欧冠冠军的球队。还有世俱杯冠军，欧洲杯冠军等。再说说其个人荣誉，欧洲最佳球员，5个金球奖，多次欧洲金靴奖等。从以上荣誉足以证明他的能力。c罗，从2004年19岁的男孩泪洒里斯本，错失欧洲杯，到2016年12年后，终于圆梦巴黎，夺得了梦寐以求的欧洲杯冠军。这12年，他经历了多少痛苦，他经历了多少困难，只有他自己知道。经过12年的努力拼搏，以及他所具有的很强的把握机遇的能力，他已经从当时的那个19岁的略带稚嫩的翩翩少年成长为了一个31岁的经验丰富的成熟的职业运动员。这一路走来，有欢笑，有泪水，有成功，有失败，但一直不变的是坚持。梅西，c罗，他们是成功的职业足球运动员，但梅西c罗他们更是励志偶像，他们的成长史就是一部奋斗的历史。他们高超的球技值得我们称赞，赞扬，他们的坚持，拼搏也值得我们学习。 在2018年年初，c罗的状态真的非常不好，甚至很难在联赛取得进球，有人说33岁的c罗老了，但是c罗用行动证明了自己，在联赛进行一段时间之后c罗逐渐找回了状态，多次取得进球，最近4月份，又是用他的“大心脏”在最后时刻顶住压力罚进点球，带领银河战舰再次闯进欧冠四强。同时，他也把同样值得尊敬的40岁的尤文门将-布冯“送回了家”。 又曾记得本赛季有一次c罗在进球后，被对方球员用脚踢到面部，有很多血流出，c罗十分疼痛。这因为c罗太拼了。这就是c罗，他做了一个球队的领袖应该做的事情。 之前在内马尔转会到巴黎圣日耳曼之前，在西甲有bbc VS msn。贝尔，本泽马可以与苏亚雷斯，内马尔抗衡，但对于c罗来说他的对手只有梅西。对于梅西而言，只有c罗才有资格成为他的对手。这两个人正在为我们联袂演绎一个精彩的足球时代。 很现实，岁月，不等人，时间，是无情的。随着岁月无情的变迁，即使我们不愿承认这个事实，但是，终究，梅西c罗的时代会过去，金球奖也会颁发给梅西c罗外的第三个人。但无论如何，克里斯蒂亚诺·罗纳尔多，梅西给我们带来的精彩的比赛，给我们带来的巅峰对决，给我们带来的足球记忆是令人难忘的。不过，作为一个球迷，我希望在梅西c罗之后，长江后浪推前浪，一代更比一代强，希望将来能出现实力更强的球员；也期待江山代有才人出，各领风骚数百年，期待在梅西c罗之后能出现更优秀的球员引领一个时代足球的发展。33岁的c罗，31岁的梅西，他们已不在年轻，希望他们在2018年的俄罗斯世界杯有精彩的表现，带领阿根廷，葡萄牙取得好的成绩。 梅西c罗，绝代双骄，正因为有实力很强大的对手，他们才能变得更强。梅西，c罗，缺少他们当中的任何一个都不会有当今足坛这二人书写的这样一段佳话，他们都值得尊敬。 梅西c罗，绝代双骄。希望他们能更长时间地保持好的状态，希望这两位足球巨星能给我们带来更多精彩的比赛！加油，克里斯蒂亚诺·罗纳尔多，加油，里奥·梅西！"}],"posts":[{"title":"开启我的博客之旅","slug":"开启我的博客之旅","date":"2018-10-10T10:52:32.000Z","updated":"2018-10-10T11:17:14.469Z","comments":true,"path":"2018/10/10/开启我的博客之旅/","link":"","permalink":"http://yoursite.com/2018/10/10/开启我的博客之旅/","excerpt":"","text":"#建博客心得体会一分耕耘，一分收获。历经很长时间的踩坑之路之后，我终于成功的搭建了自己的博客，下面，来说说我主要踩的坑吧。希望大家在自己搭建博客的时候可以参考一下。在下载，安装git时在这个步骤，主要需要注意的地方有：1.在注册了自己的github账号之后要登陆自己的邮箱进行验证。2.在新建代码仓库时，代码仓库的名字要写成yourname.github.io。在安装Node.js时在这个步骤，主要需要注意的地方有：1.在官网下载Node.js的最新版2.一路next进行安装，在安装之后，要在命令行中输入以下代码进行验证：node -vnom -v在进行与Hexo有关的相关操作时在这一部分需要注意的地方最多，要避开的坑主要有：1.尽量要在C盘以外的地盘里创建hexo文件夹。2.可以先输入以下代码在本地http://localhost进行预览hexo server3.在配置-config.yml文件时，要在：之后输入空格。相信在做好以上几个步骤之后，再参考教程就可以用hexo和github搭建出属于自己的博客了。","categories":[],"tags":[]},{"title":"cxp's fisrt blog：博客的搭建方法","slug":"hello-world","date":"2018-10-09T17:28:01.416Z","updated":"2018-10-11T08:31:29.146Z","comments":true,"path":"2018/10/10/hello-world/","link":"","permalink":"http://yoursite.com/2018/10/10/hello-world/","excerpt":"","text":"这种搭建博客的方式主要需要用到git,node.js,以及再把这两个软件安装成功后通过git bash的方式安装。先简单的说一下这种搭建博客的主要步骤。 1.搭建环境准备（主要包括node.js和githuanjing ,github账户的配置）。 2.安装Hexo。 3.配置Hexo。 4.讲hexo 与github page联系起来。 5.在已经完成了博客的搭建之后，就要开始写自己的博客了。 6.为了使博客看起来更美观，以及满足个人的个性化的审美，要为已经搭建好的博客选好合适的主题。 以下是比较详细的论述。 搭建环境准备 大概可以分为3步 .Node.js 的安装和准备。 .git的安装和准备。 .github账户的配置。 配置Node.js环境 在官网中进行下载，一路next安装即可。在安装后通过进入Windows的命令行，分别输入以下两行代码进行验证。 node -v npm -v 当出现版本号时，代表安装成功。 配置git环境 在官网下载，并且一路next进行安装，也使用和上面一样的方法进行验证。 git账户的注册和配置 这一步比较重要，可以细分为以下几个小步骤。 1.Github注册。进入GitHub的官网http://github.com/进行注册。 2.创建代码库。这一步中，代码库的名称要设置为yourname.github.io,例如，我设置成了sncxpcxp.github.io。 3.代码库设置。 安装Hexo 先在D盘下新建一个Hexo的文件夹，右击进入，选择”git bash”选项，接连输入以下代码以实现安装Hexo并检验Hexo是否安装成功。 npm install hexo-cli -g npm install hexo --save hexo -v hexo的相关配置 接下来再输入以下代码，以继续完成安装Hexo相关组件的工作。 hexo init hexo install 接下来可以首次体验Hexo并实现预览网页效果。依次输入以下代码： hexo g hexo s 这时就可以在浏览器打开http://local4000以实现预览。 将hexo与GitHub page联系起来 主要得经历以下几步： 1.配置git个人信息。 2.配置deployment。 敲黑板啦，以上就已经完成了博客的搭建工作 接下来小伙伴们就可以用markdown的编辑器来写博客，开启自己的博客之旅啦！","categories":[],"tags":[{"name":"blog","slug":"blog","permalink":"http://yoursite.com/tags/blog/"}]}]}